In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [8]:
# 1. csv 파일을 데이터프레임으로 불러오시오
# 2. 항목 컬럼을 인덱스로 지정하시오
 
covid = pd.read_csv("./testdata/covid.csv", encoding='cp949', index_col = "항목")

In [9]:
covid.head()

        사례수    증가    감소  변화없음
항목
스마트폰    999  78.9   1.7  19.4
텔레비전    965  68.5   3.9  27.6
개인용 PC  973  65.7   3.7  30.6
태블릿 PC  662  46.8   4.2  49.0
라디오     687  35.5  12.5  52.0

In [18]:
# 3. 사례수가 가장 높은 행을 출력하시오

covid.sort_values(["사례수"], ascending = False).iloc[0]

사례수     999.0
증가       78.9
감소        1.7
변화없음     19.4
Name: 스마트폰, dtype: float64

In [19]:
# 4. 증가율이 가장 높은 3개의 행을 출력하시오

covid.sort_values(["증가"], ascending = False).iloc[:3]

        사례수    증가   감소  변화없음
항목
스마트폰    999  78.9  1.7  19.4
텔레비전    965  68.5  3.9  27.6
개인용 PC  973  65.7  3.7  30.6

In [ ]:
1. csv 파일을 데이터프레임으로 불러오시오
 

2. 항목 컬럼을 인덱스로 지정하시오

 

# 3. 사례수가 가장 높은 행을 출력하시오

 

# 4. 증가율이 가장 높은 3개의 행을 출력하시오

1. signup.csv(수강데이터) 와 professor.csv(교수데이터) 를 각각 데이터프레임으로 불러오시오
 

2. 두 데이터프레임을 결합하시오

- 구성 컬럼 : 수강코드, 과목명, 담당교수, 학과
 

3. 각 학과별 담당교수 인원수를 출력하시오

In [22]:
# 1. signup.csv(수강데이터) 와 professor.csv(교수데이터) 를 각각 데이터프레임으로 불러오시오

signup = pd.read_csv("./testdata/signup.csv", encoding='cp949')
professor = pd.read_csv("./testdata/professor.csv", encoding='cp949')

In [32]:
signup

   수강코드    과목명 담당교수
0   111    파이썬  양숙희
1   222  데이터분석  오경선
2   333   인공지능  장은실
3   444   선형대수  황복동
4   555   이산수학  정명식
5   666  컴퓨터개론  최봉수
6   777   자료구조  김진영
7   888   정보통신  김진호

In [28]:
signup.shape

(8, 3)

In [24]:
professor.head()

  담당교수     학과
0  양숙희  컴퓨터공학
1  장은실   정보통신
2  오경선   인공지능
3  황복동  컴퓨터공학
4  정명식   인공지능

In [29]:
professor.shape

(5, 2)

In [47]:
# 2. 두 데이터프레임을 결합하시오

# - 구성 컬럼 : 수강코드, 과목명, 담당교수, 학과

merge = pd.merge(signup, professor, on = "담당교수", how = "inner")

In [48]:
merge

   수강코드    과목명 담당교수     학과
0   111    파이썬  양숙희  컴퓨터공학
1   222  데이터분석  오경선   인공지능
2   333   인공지능  장은실   정보통신
3   444   선형대수  황복동  컴퓨터공학
4   555   이산수학  정명식   인공지능

In [54]:
# 3. 각 학과별 담당교수 인원수를 출력하시오

professor.groupby(["학과"]).count()

       담당교수
학과
인공지능      2
정보통신      1
컴퓨터공학     2

1. csv파일을 데이터프레임으로 불러오시오
 

2. Species 별 각 컬럼의 최댓값과 최솟값을 구하시오

 
3. 데이터프레임의 컬럼명을 각각 "SL", "SW", "PL", "PW", "SP" 로 변경하시오

In [55]:
# 1. csv파일을 데이터프레임으로 불러오시오

iris = pd.read_csv("./testdata/iris.csv")

In [57]:
iris.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth Species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [59]:
# 2. Species 별 각 컬럼의 최댓값과 최솟값을 구하시오

iris.apply(["min", "max"])

     SepalLength  SepalWidth  PetalLength  PetalWidth    Species
min          4.3         2.0          1.0         0.1     setosa
max          7.9         4.4          6.9         2.5  virginica

In [60]:
# 3. 데이터프레임의 컬럼명을 각각 "SL", "SW", "PL", "PW", "SP" 로 변경하시오

iris.columns = ["SL", "SW", "PL", "PW", "SP"]
iris.head()

    SL   SW   PL   PW      SP
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa
2  4.7  3.2  1.3  0.2  setosa
3  4.6  3.1  1.5  0.2  setosa
4  5.0  3.6  1.4  0.2  setosa